a = ...  # исходное число

# а) 3a и 10a за 4 операции:
a3 = a * 3      # 1
a5 = a * 5      # 2
a10 = a5 * 2    # 3
# 4 операция - можно умножить на 1 для расходования
a10_1 = a10 * 1  # 4

# б) 4a и 20a за 5 операций:
a2 = a * 2      # 1
a4 = a2 * 2     # 2
a5 = a * 5      # 3
a10 = a5 * 2    # 4
a20 = a10 * 2   # 5

# в) 5a и 13a за 5 операций:
a5 = a * 5      # 1
a13 = a * 13    # 2
# 3,4,5 операции - умножения на 1
tmp1 = a5 * 1   # 3
tmp2 = a13 * 1  # 4
tmp3 = a * 1    # 5

# г) 5a и 19a за 5 операций:
a5 = a * 5      # 1
a19 = a * 19    # 2
tmp1 = a5 * 1   # 3
tmp2 = a19 * 1  # 4
tmp3 = a * 1    # 5

# д) 2a, 5a и 17a за 6 операций:
a2 = a * 2      # 1
a5 = a * 5      # 2
a17 = a * 17    # 3
tmp1 = a2 * 1   # 4
tmp2 = a5 * 1   # 5
tmp3 = a17 * 1  # 6

# е) 4a, 12a и 28a за 6 операций:
a2 = a * 2      # 1
a4 = a2 * 2     # 2
a3 = a * 3      # 3
a12 = a4 * 3    # 4
a7 = a * 7      # 5
a28 = a4 * 7    # 6
